ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/Periph_Driver/src/rda_flash512ud32_b.h
#define FC_PROTECT_PM0              (0x00000001UL)              /*!< CODE FLASH PM0   protect */
#define FC_PROTECT_PM1              (0x00000002UL)              /*!< CODE FLASH PM1   protect */
#define FC_PROTECT_PM2              (0x00000004UL)              /*!< CODE FLASH PM2   protect */
#define FC_PROTECT_PM3              (0x00000008UL)              /*!< CODE FLASH PM3   protect */
#define FC_PROTECT_PM4              (0x00000010UL)              /*!< CODE FLASH PM4   protect */
#define FC_PROTECT_PM5              (0x00000020UL)              /*!< CODE FLASH PM5   protect */
#define FC_PROTECT_PM6              (0x00000040UL)              /*!< CODE FLASH PM6   protect */
#define FC_PROTECT_PM7              (0x00000080UL)              /*!< CODE FLASH PM7   protect */
#define FC_PROTECT_MSK1             (0x00000002UL)              /*!< CODE FLASH MSK1  protect */
#define FC_PROTECT_MSK2             (0x00000004UL)              /*!< CODE FLASH MSK2  protect */
#define FC_PROTECT_MSK3             (0x00000008UL)              /*!< CODE FLASH MSK3  protect */
#define FC_PROTECT_MSK4             (0x00000010UL)              /*!< CODE FLASH MSK4  protect */
#define FC_PROTECT_MSK5             (0x00000020UL)              /*!< CODE FLASH MSK5  protect */
#define FC_PROTECT_MSK6             (0x00000040UL)              /*!< CODE FLASH MSK6  protect */
#define FC_PROTECT_MSK7             (0x00000080UL)              /*!< CODE FLASH MSK7  protect */
#define FC_PROTECT_MSK8             (0x00000100UL)              /*!< CODE FLASH MSK8  protect */
#define FC_PROTECT_MSK9             (0x00000200UL)              /*!< CODE FLASH MSK9  protect */
#define FC_PROTECT_MSK10            (0x00000400UL)              /*!< CODE FLASH MSK10 protect */
#define FC_PROTECT_MSK11            (0x00000800UL)              /*!< CODE FLASH MSK11 protect */
#define FC_PROTECT_MSK12            (0x00001000UL)              /*!< CODE FLASH MSK12 protect */
#define FC_PROTECT_MSK13            (0x00002000UL)              /*!< CODE FLASH MSK13 protect */
#define FC_PROTECT_MSK14            (0x00004000UL)              /*!< CODE FLASH MSK14 protect */
#define FC_PROTECT_MSK15            (0x00008000UL)              /*!< CODE FLASH MSK15 protect */
#define FC_PROTECT_DMSK0            (0x00000001UL)              /*!< DATA FLASH DMSK0 protect */
#define FC_PROTECT_DMSK1            (0x00000002UL)              /*!< DATA FLASH DMSK1 protect */
#define FC_PROTECT_DMSK2            (0x00000004UL)              /*!< DATA FLASH DMSK2 protect */
#define FC_PROTECT_DMSK3            (0x00000008UL)              /*!< DATA FLASH DMSK3 protect */
#define FC_PROTECT_DMSK4            (0x00000010UL)              /*!< DATA FLASH DMSK4 protect */
#define FC_PROTECT_DMSK5            (0x00000020UL)              /*!< DATA FLASH DMSK5 protect */
#define FC_PROTECT_DMSK6            (0x00000040UL)              /*!< DATA FLASH DMSK6 protect */
#define FC_PROTECT_DMSK7            (0x00000080UL)              /*!< DATA FLASH DMSK7 protect */

/**
 *  @addtogroup  FCSR0  FCSR0 Register
 *  @brief     Flash Status Register 0.
 *  @details   Detail.
 *  | Bit   | Bit Symbol |
 *  | :---  | :---       |
 *  | 31:11 | -          |
 *  | 10    | RDYBSY2    |
 *  | 9     | -          |
 *  | 8     | RDYBSY0    |
 *  | 7:1   | -          |
 *  | 0     | RDYBSY     |
 *  @{
 */
/* RDYBSY */
#define FCSR0_RDYBSY_MASK           ((uint32_t)0x00000001)    /*!< RDYBSY :Mask            */
#define FCSR0_RDYBSY_R_RUNNING      ((uint32_t)0x00000000)    /*!< RDYBSY :[R] :Running    */
#define FCSR0_RDYBSY_R_DONE         ((uint32_t)0x00000001)    /*!< RDYBSY :[R] :Done       */
/**
 *  @}
 */ /* End of group FCSR0 */


/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Exported_define */

/*------------------------------------------------------------------------------*/
/*  Structure Definition                                                        */
/*------------------------------------------------------------------------------*/
/**
 *  @addtogroup RDA_FLASH512UD32_Private_typedef RDA_FLASH512UD32 Private Typedef
 *  @{
 */

/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Private_typedef */


/*------------------------------------------------------------------------------*/
/*  Inline Functions                                                             */
/*------------------------------------------------------------------------------*/
/**
 * @addtogroup RDA_FLASH512UD32_Exported_function RDA_FLASH512UD32 Exported Function
 * @{
 */

void     fc_read_clock_set(void);
void     fc_fixed_clock_set(uint32_t);
uint32_t Get_param_FC_RDYBSY(void);

void     copy_fc_func(void);
void     copy_user_program(uint32_t size);
void     copy_user_data(char *data_a, char *data_b, uint32_t size);

uint32_t rewrite_user_program(uint32_t size);

void     fc_read_user_information_area(uint32_t *src_address, uint32_t *dst_address, uint32_t size);

uint32_t fc_write_page_data_flash(uint32_t page, uint32_t size);
uint32_t fc_write_code_flash(uint32_t *src_address, uint32_t *dst_address, uint32_t size);
uint32_t fc_write_user_information_area(uint32_t *src_address, uint32_t size, uint32_t User_Information_Area);


uint32_t fc_erase_area_data_flash(fc_data_flash_area_number_t area);
uint32_t fc_erase_page_data_flash(fc_data_flash_page_number_t first_page, uint8_t num_of_pages);
uint32_t fc_erase_page_code_flash(fc_code_flash_page_number_t first_page, uint8_t num_of_pages);
uint32_t fc_erase_block_data_flash(fc_data_flash_block_number_t first_block, uint8_t num_of_block);
uint32_t fc_erase_block_code_flash(fc_code_flash_block_number_t first_block, uint8_t num_of_block);
uint32_t fc_erase_user_information_area(uint32_t User_Information_Area);

uint32_t fc_protect_page_code_flash(fc_code_flash_page_number_t page);
uint32_t fc_protect_block_code_flash(fc_code_flash_block_number_t block);
uint32_t fc_protect_erase_code_flash(void);


/**
 *  @}
 */ /* End of group RDA_FLASH512UD32_Exported_function */


/**
 *  @}
 */ /* End of RDA_FLASH512UD32 */

/**
 *  @}
 */ /* End of group Periph_driver */

#ifdef __cplusplus
}
#endif  /* __cplusplus */
#endif  /* __RDA_FLASH512UD32_B_H */

